{"pageProps":{"posts":[{"slug":"meetoo-devlog-1","title":"meetoo Devlog #1: iCloud Calendar Integration","date":"2023-10-8","excerpt":"For the past few months, I have been working on an app for iOS and Android called meetoo that helps make it easier for friends to plan meetups. The gist of it is that users create profiles and sync their personal calendars, allowing their friends in the app to see when they are free or busy.","coverImage":"/assets/blog/hello-world/cover.jpg","iconPrefix":"fa-solid","iconName":"code","tags":["meetoo","programming"]},{"slug":"the-paradox-of-the-perfect-spiral","title":"The Paradox of the Perfect Spiral","date":"2021-09-26","excerpt":"Any fan of the NFL can appreciate the beauty of a perfect spiral pass. We've seen it time and time again: a quarterback steps forward, cocks the ball back, and launches a deep pass off their fingertips. The ball points upwards immediately after release, but as the ball sails through the air, the nose gradually dips downwards before landing right in the hands of the receiver.","coverImage":"/assets/blog/hello-world/cover.jpg","iconPrefix":"fa-solid","iconName":"football","tags":["math","sports"]},{"slug":"feynmans-technique-for-computing-integrals","title":"Feynman's Technique for Computing Integrals","date":"2020-10-19","excerpt":"According to Feynman, \"When guys at MIT or Princeton had trouble doing a certain integral, it was because they couldn’t do it with the standard methods they had learned in school...Then I come along and try differentiating under the integral sign, and often it worked. So I got a great reputation for doing integrals, only because my box of tools was different from everybody else's.\"","coverImage":"/assets/blog/hello-world/cover.jpg","iconPrefix":"fa-solid","iconName":"calculator","tags":["math"]},{"slug":"mathematics-in-basketball","title":"Mathematics in Basketball","date":"2019-05-11","excerpt":"If you were coaching a basketball team, it seems like common sense to give your best player the majority of the shots in the game. Logically, the best player should give you the best chance of making a shot on any given possession. However, is this really the best method? What about factors like fatigue, the defense, and rhythm?","coverImage":"/assets/blog/hello-world/cover.jpg","iconPrefix":"fa-solid","iconName":"basketball","tags":["math","sports"]}]},"__N_SSG":true}